tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "derailed/k9s"
tap "homebrew/cask-versions"
tap "1password/tap/1password-cli"

# source control management
brew "git"
brew "git-lfs"

# package manager for iOS
brew "cocoapods"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU privacy guard for certificates and cryptography
brew "gnupg"
# Package and application manager for Kubernetes
brew "helm"
# java env manager
brew "jenv"
# JSON parsing utility for the terminal
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "fnm"
# Manage multiple Python environments and version
brew "pyenv"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Rust programming language
brew "rustup"

# 1password CLI
cask "1password/tap/1password-cli"
# App to build and share containerized applications and microservices
cask "docker"
# Browser for web development
cask "google-chrome"
# google drive
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Collaboration platform for API development
cask "postman"
# markdown preview in finder
cask "qlmarkdown"
# window management for MacOS
cask "spectacle"
# very customizable launcher
cask "raycast"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"