tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Basic of basics
brew "coreutils"
brew "curl"
brew "gawk"
brew "git"
brew "git-lfs"
brew "openssl"
brew "wget"

#########################################################################
# Packages
#########################################################################
#1Password CLI
brew "1password-cli"
# Tools version manager
brew "asdf"
# bundler gem manager
brew "bundler"
# package manager for iOS
brew "cocoapods"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# command line fuzzy finder
brew "fzf"
# C compiler
brew "gcc"
# Github CLI tool
brew "gh"
# GNU privacy guard for certificates and cryptography
brew "gnupg"
# Package and application manager for Kubernetes
brew "helm"
# JSON parsing utility for the terminal
brew "jq"
# Replacement for ls command
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Alternative to grep command
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Dotfiles manager
brew "stow"
# Better manual pages
brew "tldr"
# Watch files and take action when they change
brew "watchman"
# A better CD command
brew "zoxide"

#########################################################################
# Casks (regular mac Apps)
#########################################################################
#1Password App
cask "1password"
# Arc browser (my current main browser)
cask "arc"
# private web browsing
cask "brave-browser"
# ChatGPT official app
cask "chatgpt"
# App to build and share containerized applications and microservices
cask "docker"
# Figma design tool
cask "figma"
# Firefox browser for web testing
cask "firefox"
# Browser for web development
cask "google-chrome"
# google drive
cask "google-drive"
# mac menu bar app manager
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# screen recorder
cask "kap"
# keyboard visualizer for screencasts
cask "keycastr"
# vpn service
cask "nordvpn"
# Projects and notes on the cloud
cask "notion"
# Video casting and recording
cask "obs"
# Open-source note taking app
cask "obsidian"
# very customizable launcher
cask "raycast"
# window management for MacOS
cask "rectangle"
# freemium software modeling tool
cask "staruml"
# syntax highlighting for finder
cask "syntax-highlight"
# unarchiving utility app
cask "the-unarchiver"
# Virtual machines for MacOS ARM64
cask "utm"
# open source video player for multiple formats
cask "vlc"
# Open-source code editor
cask "visual-studio-code"
# Chat messaging app
cask "whatsapp"

#########################################################################
# Fonts
#########################################################################
# Victor Mono
cask "font-victor-mono-nerd-font"
# JetBrains Mono
cask "font-jetbrains-mono-nerd-font"
