tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

# Basic of basics
brew "coreutils"
brew "curl"
brew "gawk"
brew "git"
brew "git-lfs"
brew "openssl"
brew "wget"

#########################################################################
# Packages
#########################################################################
#1Password CLI
brew "1password-cli"
# Tools version manager
brew "asdf"
# AWS cli
brew "awscli"
# Better Cat command
brew "bat"
# syntax-highlighting pager for git, diff, grep, and blame output
brew "git-delta"
# Alternative to the find command
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fish extension manager
brew "fisher"
# command line fuzzy finder
brew "fzf"
# Github CLI tool
brew "gh"
# GNU privacy guard for certificates and cryptography
brew "gnupg"
# JSON parsing utility for the terminal
brew "jq"
# Replacement for ls command
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Alternative to grep command
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Dotfiles manager
brew "stow"
# Better manual pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# A better CD command
brew "zoxide"

#########################################################################
# Casks (regular mac Apps)
#########################################################################
#1Password App
cask "1password"
# Arc browser (my current main browser)
cask "arc"
# screen capture app
cask "cap"
# Cursor IDE
cask "cursor"
# Cursor agent CLI
cask "cursor-cli"
# Figma design tool
cask "figma"
# Firefox browser for web testing
cask "firefox"
# Browser for web development
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "ghostty"
# screen recorder
cask "kap"
# Projects and notes on the cloud
cask "notion"
# Calendar app
cask "notion-calendar"
# Email app
cask "notion-mail"
# Open-source note taking app
cask "obsidian"
# VPN
cask "pritunl"
# keyboard visualizer for screencasts
cask "keycastr"
# very customizable launcher
cask "raycast"
# Chat messaging app
cask "whatsapp"

#########################################################################
# Fonts
#########################################################################
# JetBrains Mono Nerd Font
cask "font-jetbrains-mono-nerd-font"
# JetBrains Mono regular font
cask "font-jetbrains-mono"
